In [752]:
import pandas as pd
pd.Series([1,2,3,4],['행1', '행2', '행3', '행4'])["행2"]
pd.Series([1,2,3,4],['행1', '행2', '행3', '행4']).loc[["행2","행3","행2"]]
pd.Series([1,2,3,4],['행1', '행2', '행3', '행4'])[:]
pd.Series([1,2,3,4],['행1', '행2', '행3', '행4'])[:2]
pd.Series([1,2,3,4],['행1', '행2', '행3', '행4']).iloc[:2]
pd.Series([1,2,3,4],['행1', '행2', '행3', '행4']).loc['행2':"행4"]
pd.Series([1,2,3,4],['행1', '행2', '행3', '행4']).loc[['행2',"행4"]]

행2    2
행4    4
dtype: int64

In [753]:
a = pd.Series([1,2,3,4],['행1', '행2', '행3', '행4']).loc['행2':"행4"]
del a["행3"]
a

행2    2
행4    4
dtype: int64

In [754]:
pd.Series([1,2,3,4],['행1', '행2', '행3', '행4']).loc['행2':"행4"].drop("행3")

행2    2
행4    4
dtype: int64

In [755]:
pd.Series([1,2,3,4],['행1', '행2', '행3', '행4']).loc['행2':"행4":2]

행2    2
행4    4
dtype: int64

In [756]:
arr = [
    [1,2,3],
    [4,5,6],
    [7,8,9]
]
idx = ['1행', '2행', '3행']
col = ['1열', '2열', '3열']
df1 = pd.DataFrame(arr, index = idx, columns = col)

df2 = pd.DataFrame(arr[1:],index = idx[1:], columns = col)

df1+df2

#동일한 행 명이 없는 것은 덧셈이 안됨
#df2에서 1행은 존재하지 않으므로 동일행 명이 없는 것은 계산이 안된 것

      1열    2열    3열
1행   NaN   NaN   NaN
2행   8.0  10.0  12.0
3행  14.0  16.0  18.0

In [757]:
s = pd.Series(arr[:1], idx[:1])
df1+s
# s는 시리즈이므로 열이 없기 때문에 동일한 명이 없는 행렬의 요소가 없어서 계산이 안됨.

#데이터프레임에서 연산은 해당 행명과 해당 열명이 같아야 연산이 됨.

     1열   1행   2열   3열
1행  NaN  NaN  NaN  NaN
2행  NaN  NaN  NaN  NaN
3행  NaN  NaN  NaN  NaN

In [758]:
arr3 = [
    [1,2,3],
    [4,5,6],
    [7,8,9]
]
idx3 = ['1행1', '2행1', '3행1']
col3 = ['1열1', '2열1', '3열1']
df3 = pd.DataFrame(arr3, index = idx3, columns = col3)

df3+df1

     1열  1열1  2열  2열1  3열  3열1
1행  NaN  NaN NaN  NaN NaN  NaN
1행1 NaN  NaN NaN  NaN NaN  NaN
2행  NaN  NaN NaN  NaN NaN  NaN
2행1 NaN  NaN NaN  NaN NaN  NaN
3행  NaN  NaN NaN  NaN NaN  NaN
3행1 NaN  NaN NaN  NaN NaN  NaN

In [759]:
df4 = pd.DataFrame(arr[:1], index = idx[:1],columns=col)
df1+df4

     1열   2열   3열
1행  2.0  4.0  6.0
2행  NaN  NaN  NaN
3행  NaN  NaN  NaN

In [760]:
'''
arr[0].pop()
arr[1].pop()
arr[2].pop()
arr
'''

'\narr[0].pop()\narr[1].pop()\narr[2].pop()\narr\n'

In [761]:
#del df1["3열"]
df1

    1열  2열  3열
1행   1   2   3
2행   4   5   6
3행   7   8   9

In [762]:
for list in arr:
    list.pop(1)
    print(list)
print (arr)
col.pop(1)
df5 = pd.DataFrame(arr, index = idx, columns = col)
df5
df1+df5

[1, 3]
[4, 6]
[7, 9]
[[1, 3], [4, 6], [7, 9]]

    1열  2열  3열
1행   2 NaN   6
2행   8 NaN  12
3행  14 NaN  18

In [763]:
import numpy as np
a = np.random.randint(0,10,24).reshape(4,6)
l1 = ['가', '나', '다', '라']
l2 = ['A', 'B', 'C', 'D', 'E', 'F']
df = pd.DataFrame(a, l1, l2)
df

   A  B  C  D  E  F
가  2  3  3  0  8  0
나  8  8  8  3  4  3
다  0  2  1  6  9  1
라  8  4  5  6  4  7

In [764]:
df[["A"]]

   A
가  2
나  8
다  0
라  8

In [765]:
b = df[["B", "C"]][1:3]
b
#c = b[1:3]
#c
df.loc["나":"다","B":"C"]
df.loc[["나","다"],["B","C"]]
#필터와 슬라이싱 개념 정확하게 알기
b

   B  C
나  8  8
다  2  1

In [766]:
df.iloc[1:3,1:3].drop("B",axis = 1)
#drop은 행 부분에서 지운다
#열 에서 지우고싶다면 축 방향 추가
#axis = 0은 기본값임. 0은 행방향

   C
나  8
다  1

In [767]:
import pandas as pd

a1 = [60, 84, 80, 70, 19]
a2 = [77, 62, 95, 85, 17]
a3 = [61, 97, 95, 67, 15]
a4 = [75, 65, 72, 51, 18]
idx = ['A','B','C','D']
cols = ["국어", "영어", "수학", "과학", "나이"]
df = pd.DataFrame([a1, a2, a3, a4], index=idx, columns=cols)
df.sort_values(["영어"], ascending=0)

   국어  영어  수학  과학  나이
C  61  97  95  67  15
A  60  84  80  70  19
D  75  65  72  51  18
B  77  62  95  85  17

In [768]:

df.sort_values(["영어", "수학"], ascending=[1,0])

   국어  영어  수학  과학  나이
B  77  62  95  85  17
D  75  65  72  51  18
A  60  84  80  70  19
C  61  97  95  67  15

In [769]:
#Q1. 위의 성적표에서 수학 점수가 동률인 것만 출력하시오.

s = df.sort_values("수학", ascending = False)["수학"]

print (s)

for i in range(len(s)-1):
    if s[i] == s[i+1]:
        print (s.index[i], s.index[i+1], s[i], s[i+1])
                
#    else:
#        break

B    95
C    95
A    80
D    72
Name: 수학, dtype: int64
B C 95 95

C:\Users\hi\AppData\Local\Temp\ipykernel_6416\816948130.py:8: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  if s[i] == s[i+1]:
C:\Users\hi\AppData\Local\Temp\ipykernel_6416\816948130.py:9: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print (s.index[i], s.index[i+1], s[i], s[i+1])

In [770]:
#선생님 풀이
#counts 기능을 사용해보자
d1 = df["수학"].sort_values(ascending=0)
cnt = d1.value_counts()
#밸류기준으로 수를 세려라
cnt[cnt>1]
#1개보다 많은거 골라라 그리고 그 수가 몇이냐
idxs = cnt[cnt>1].index
# 많은거 인덱스가 뭐냐 (95)
비교값 = idxs[0]
print (type(d1))
print (d1)
print(비교값)
print(d1[d1 == 비교값])

<class 'pandas.core.series.Series'>
B    95
C    95
A    80
D    72
Name: 수학, dtype: int64
95
B    95
C    95
Name: 수학, dtype: int64

In [771]:
#행
# df1+df2는 df1.add(df2)와 같은 의미이다
print(f'{df1.add(df2)}\n')
print (df1)

df1.loc["4행"] = [10,11,12]
df1["4열"] = ['a','b','c','d']
df1

      1열    2열    3열
1행   NaN   NaN   NaN
2행   8.0  10.0  12.0
3행  14.0  16.0  18.0

    1열  2열  3열
1행   1   2   3
2행   4   5   6
3행   7   8   9

    1열  2열  3열 4열
1행   1   2   3  a
2행   4   5   6  b
3행   7   8   9  c
4행  10  11  12  d

In [772]:
df1.drop("4행", inplace=True)
df1

    1열  2열  3열 4열
1행   1   2   3  a
2행   4   5   6  b
3행   7   8   9  c